' файл Excel містить номери телефонів, які можуть бути задані в довільному форматі
' необхідно залишити лише українські мобільні номери телефонів

'мобільний телефон українських номерів може містити максимально  13 числ в форматі 380 XY YYYYYYY, де число Х може мати значення 1-9, але не 0, а числа Y можуть приймати будь яке значення 



Sub clean_phone()

    
    Dim d1          As Long
    Dim d2          As Long
    
    
    Dim i           As Long
    Dim j           As Long
    Dim li          As Long
    Dim new_colum      As Long
    
    i = 1        
    j = 2        'визначаємо колонку в якій знаходяться номери телефонів, в даному випадку це 2 колнка, тобто колонка "В"
	r = ActiveSheet.Cells(ActiveSheet.Rows.Count, "A").End(xlUp).Row + 30    ' визначаємо кількість рядків в таблиці в залежності від того скільки запесів існує в першій колонці
    

    
' -------------------------------------------------------------------------------------------------------
    ' копіюємо колонку  в якій знаходяться номери
    
    new_colum = j + 1    
    Columns(new_colum).EntireColumn.Insert  'стоврюємо нову пусту колонку
    Columns(j).Copy Columns(new_colum) ' копіюємо значення колонки j в новостоврену колонку new_colum
    
    Dim Column      As Range: Set Column = Application.Columns(new_colum)
 ' -------------------------------------------------------------------------------------------------------
 ' -------------------------------------------------------------------------------------------------------
    'видаляємо зайві символи
    
    
    Column.Replace "(", ""
    Column.Replace ")", ""
    Column.Replace "-", ""
    Column.Replace "+", ""
    Column.Replace "_", ""
    Column.Replace ":", ""
    Column.Replace "~?", ""
    Column.Replace "~*", ""
    Column.Replace "@", ""
    Column.Replace """", ""
    Column.Replace "'", ""
    Column.Replace "`", ""
    Column.Replace " ", ""
    Column.Replace " ", ""
    Column.Replace " ", ""
    Column.Replace "    ", ""

     'видаляємо текстові та інші символи  
	 'які коди за який символ відповідають можна подивитися тут:   https://www.ascii-codes.com/cp855.html 
     
    Column.Replace Chr(10), ""
    Column.Replace Chr(13), ""
 
    For li = 97 To 122  ' A-Z
        Column.Replace Chr(li), ""
    Next li
    
    For li = 65 To 90 'a-z
        Column.Replace Chr(li), ""
    Next li
    
    For li = 128 To 225 'кирилиця
        Column.Replace Chr(li), ""
    Next li
    

    ' -------------------------------------------------------------------------------------------------------
	' в одному полі може зустрчатися записано декілька номерів телефонів. замінємо можливі знаки для позначення, двох мобільних телефонів
    Column.Replace ",", ";"
    Column.Replace ".", ";"
    Column.Replace "/", ";"
 
    ' -------------------------------------------------------------------------------------------------------
     ' цикл для обробки значень які містять два мобільних телефони
    
    For i = r To 2 Step -1
      
        d1 = InStr(1, Cells(i, new_colum), ";") - 1   'визнчаємо довжину номера телефона, що знаходиться до знаку ";", надалі називатимемо його першим (ліва частина)
        d2 = Len(Cells(i, new_colum)) - d1 - 1 'визнчаємо довжину номера телефона, що знаходиться після знаку ";" , надалі називатимемо його другим (права частина)
        
        
    'телефон необхідний мати мінімум 9 символів в іншому випдаку він є неповним/стаціонарним номером телефону без коду міста
        
        If d1 < 9 And d2 < 9 Then   'якщо обоє номерів телефонів мають менше 9 символів, то видаляємо рядок із цим занченням
            ActiveSheet.Rows(i).Delete    
        
        ElseIf d1 >= 9 And d2 < 9 Then 'якщо перший номер має більше 9 символів, а другий менше 9, то залишаємо лише перший номер
            Cells(i, new_colum) = Left(Cells(i, new_colum), d1)
        
        ElseIf d1 < 9 And d2 >= 9 Then 'якщо другий номер має більше 9 символів, а перший менше 9, то залишаємо лише другий номер
            Cells(i, new_colum) = Right(Cells(i, new_colum), d2)
        
        ElseIf d1 >= 9 And d2 >= 9 Then 'якщо обоє номерів мають більше 9 символів, то залишаємо їх обох
            Rows(i).EntireRow.Insert   
            Rows(i).EntireRow.Insert 	'вставляємо два нових рядки
            Rows(i + 2).Copy Rows(i)
            Rows(i + 2).Copy Rows(i + 1)  'копіюємо в новостворені рядки, розглядуваний рядок 
            Cells(i + 1, new_colum) = Left(Cells(i, new_colum), d1) 'в одному новоствореному рядку залишаємо лише перший номер
            Cells(i + 2, new_colum) = Right(Cells(i, new_colum), d2) 'в іншому новоствореному рядку залишаємо лише другий номер
            ActiveSheet.Rows(i).Delete 'видаляємо початковий рядок, який містив два номери телефону
        End If
  
    Next
    
' -------------------------------------------------------------------------------------------------------
 
' видляємо некоректні номери телефону
    
    For i = r To 2 Step -1
  
        If Len(Cells(i, new_colum)) < 9 Then  'видаляємо телефони, що містять менше 9 символів
            ActiveSheet.Rows(i).Delete
        
        ElseIf Len(Cells(i, new_colum)) >= 13 Then   'видаляємо телефони, що містять більше 12 символів
            ActiveSheet.Rows(i).Delete
        ElseIf Len(Cells(i, new_colum)) = 12 And Left(Cells(i, new_colum), 3) <> "380" Then 'код України "380", тому якщо номер має 12 чисел, то він повинен починатися на ці цифри, в іншому випадку видаляємо рядок
            ActiveSheet.Rows(i).Delete
        ElseIf Len(Cells(i, new_colum)) = 11 And Left(Cells(i, new_colum), 2) <> "80" Then 'код України "380", тому якщо номер має 11 чисел, то він повинен починатися на цифри "80", в іншому випадку видаляємо рядок
            ActiveSheet.Rows(i).Delete
        ElseIf Len(Cells(i, new_colum)) = 10 And Left(Cells(i, new_colum), 1) <> "0" Then 'код України "380", тому якщо номер має 10 чисел, то він повинен починатися на цифри "0", в іншому випадку видаляємо рядок. Оскільки після видаленя не числових символів номери відображаються в числовому форматі, то значень із 10 символами взагалі не повинно існувати
         ActiveSheet.Rows(i).Delete
        ElseIf Len(Cells(i, new_colum)) = 9 And Left(Cells(i, new_colum), 1) = "0" Then 'номер оператора не може починатися на 9, тому, якщо це так, то видаляємо цей рядок
            ActiveSheet.Rows(i).Delete
        End If
    Next
    
 ' -------------------------------------------------------------------------------------------------------
    ' змінюємо номер

    For i = r To 2 Step -1
        Cells(i, new_colum) = Right(Cells(i, new_colum) * 1, 9)   'оскільки не всі номери мають формат 380 XY YYYYYYY, то обрізаємо номер лише до 9 правих симолів (XY YYYYYYY)
        Cells(i, new_colum) = (380 & Cells(i, new_colum)) 'додаємо до символів (XY YYYYYYY) значення 380 утоворюючи номер  в форматі  380 XY YYYYYYY
        Cells(i, new_colum).NumberFormat = "0"
  
    Next
    
    
    Cells(1, new_colum) = "Коректний номер"
    
End Sub





